class ComponentMarkers:
    ACK_MARKERS = [
        "понятно", "ясно", "согласен", "понял", "хорошо", "ага", "угу", "да"
    ]

    BRIDGE_MARKERS = [
        "давайте", "поговорим", "для начала", "теперь", "вернемся", "следующий", "в курсе",
        "давайте поговорим", "мы поговорим", "второй",
        "первый", "поговорим", "вы не договорили про", "вернемся к", "но все-таки про", "помните",
        "помнишь", "вспомни", "вспомните"
    ]

    PARAPHRASE_MARKERS = [
        "то есть", "в общем", "получается",
        "я понял", "то, что", "вы говорите, что", "оказывается", "чтобы", "сказал, что"
    ]

    EMPATHY_MARKERS = [
        "я понимаю", "понимаю вас", "мне вас жаль", "сочувствую", "держитесь",
        "неприятно", "тяжело", "непросто", "сложно",
        "ого", "о!", "простите", "прости", "извини", "извините",
        "круто", "супер", "какая история", "так это же круто",
        "но ведь", "разве", "вы уверены", "а почему не",
        "подождите", "ваша логика", "если все так делают", "о"
    ]

    REQUEST_MARKERS = [
        "расскажите", "расскажи", "объясни", "объясните", "почему", "как", "что", "какой", "кто", "когда", "сколько",
        "скажи", "давно", "с каких пор", "бывали", "были", "на ваш взгляд", "на твой взгляд",
        "что значит", "в смысле", "что это", "какие", "правильно понимаю", "расскажите",
        "уточните", "конкретнее", "почему именно", "то есть", "как я понимаю", "что за", "и что", "да?", "типа",
        "объясни", "объясните", "приведи пример", "приведите пример",
        "расскажи", "рассказывай", "ответь", "ответьте", "опиши", "поясни", "поясните", "можешь рассказать",
        "можете рассказать",
    ]