class ComponentMarkers:
    ACK_MARKERS = [
        "понятно", "ясно", "согласен", "понял", "хорошо"
    ]

    BRIDGE_MARKERS = [
        "давайте", "поговорим", "для начала", "теперь", "вернемся", "следующий", "в курсе",
    ]

    PARAPHRASE_MARKERS = [
        "то есть", "в общем", "получается", "я понял", "то, что", "вы говорите, что"
    ]

    EMPATHY_MARKERS = [
        "понимаю", "неприятно", "тяжело", "непросто", "сложно"
    ]

    REQUEST_MARKERS = [
        "расскажите", "расскажи", "объясни", "объясните", "почему", "как", "что", "какой", "кто", "когда", "сколько",
        "скажи", "давно", "с каких пор", "бывали", "были", "на ваш взгляд", "на твой взгляд"
    ]