class InterviewerActionMarkers:
    BACKCHANNEL = [
        "ага", "угу", "ой", "о-о-о", "о"
    ]

    ACKNOWLEDGMENT = [
        "понятно", "ясно", "согласен", "понял", "хорошо"
    ]

    CLARIFICATION = [
        "что значит", "в смысле", "что это", "какие", "правильно понимаю", "расскажите",
        "уточните", "конкретнее", "почему именно", "то есть", "как я понимаю", "что за", "и что", "да?", "типа",
        "объясни", "объясните", "приведи пример", "приведите пример"
    ]

    TRANSITION_MARKERS = [
        "давайте поговорим", "мы поговорим", "для начала", "теперь", "вернемся", "следующий", "в курсе", "второй",
        "первый", "поговорим", "вы не договорили про", "вернемся к", "но все-таки про", "помните", "помнишь", "вспомни", "вспомните"
    ]

    SUMMARY = [
        "то есть", "в общем", "получается",
        "я понял", "то, что", "вы говорите, что", "оказывается", "чтобы", "сказал, что"
    ]



class InterviewerQuestionOpennessMarkers:
    OPEN_QUESTION = [
        "расскажите", "расскажи", "объясни", "объясните", "например", "думаете", "думаешь",
        "почему", "как", "что", "какой", "каким", "каком", "какая", "какое", "какого", "какие", "каких",
        "которое", "который", "которая", "которые",
        "кто", "кого", "кем", "чем", "зачем", "чего",
        "когда", "сколько", "где", "как-то", "куда",
        "скажи", "скажите", "давно", "с каких пор", "бывали", "были", "на ваш взгляд", "на твой взгляд",
        "если бы", "а чего", "а почему",
    ]

    CLOSED_END = (
        "да?", "нет?", "правильно?", "не так ли?", "правильно понимаю?",
        "можно?", "было?", "мало?", "много?", "потом?",
        "понимаешь?", "связано?", "разве?"
    )

    CLOSED_START = (
        "вы", "ты", "это", "они", "там",
        "было", "есть", "эта", "этот", "вы же", "чтобы",
        "у тебя", "у вас", "а вы", "а ты", "а она", "а он",
        "а у тебя", "а у вас", "то есть", "в смысле",
    )

    BLITZ = [
        "или", "блиц"
    ]


class InterviewerEmotionMarkers:
    CHALLENGE_MARKERS = [
        "но ведь", "разве", "вы уверены", "а почему не", "подождите", "ваша логика", "это же", "если все так делают"
    ]

    EMPATHY_MARKERS = [
        "понимаю", "неприятно", "тяжело", "непросто", "сложно",
        "ого", "о!", "простите", "прости", "извини", "извините"
    ]

    COMMENTARY_MARKERS = [
        "круто", "супер", "какая история", "так это же круто"
    ]


class InterviewerTechniqueMarkers:
    BEHAVIOUR = [
        "когда последний раз", "было ли", "бывали ли", "как это было",
        "в вашей жизни", "вы переживали", "вы говорили", "вы ездили", "вы были"
    ]

    WHY_QUESTION = [
        "почему", "зачем"
    ]

    HOW_QUESTION = [
        "как", "каким образом"
    ]

    VALUES = [
        "как вы относитесь", "что для вас значит", "разве не круто", "логик"
    ]

    FACT_CHECK = [
        "это правда", "действительно", "это было", "вы смотрели",
        "это фотошоп", "правда ли",
    ]

    DEFINITION = [
        "что значит", "что это такое", "что это", "что это за", "в смысле"
    ]

    REACTION = [
        "как вы отреагировали", "как ты отреагировал",
        "что почувствовали", "что почувствовал",
        "какая эмоция", "переживали",
    ]

    QUANTITY = [
        "сколько", "какая сумма", "что стоила",
        "что стоило", "цена", "стоимость"
    ]

    TIME = [
        "когда", "с каких пор",
        "до ", "после ",
        "в тот период", "последний раз"
    ]

    BACKGROUND = [
        "что это собой представляет", "как вы жили",
        "что это за",
        "где ты взял", "где вы взяли",
    ]

    RELATIONSHIP = [
        "кореша", "друзья", "знакомые"
        "вторая половина",
        "жена", "мама", "папа", "родные", "брат", "сестра"
    ]

    OPINION = [
        "как вы относитесь", "на ваш взгляд", "согласны с этим", "почему именно ее", "почему именно"
    ]

    EXAMPLE = [
        "расскажите", "приведите пример",
        "был случай", "самая крутая история", "история"
    ]

    HYPOTHETICAL_MARKERS = [
        "если бы", "представьте", "допустим", "а что если"
    ]

    CONFIRMATION = [
        "да?",
        "правильно понимаю",
        "я правильно понимаю",
        "то есть",
        "поэтому",
    ]

    FOLLOWUP = [
        "почему?", "какие?", "а она что?", "расскажите.", "расскажите", "что дальше?"
    ]


class GuestAnswerTypeMarkers:

    STORY_MARKERS = [
        "однажды", "помню", "было дело", "позавчера", "в прошлом", "назад", "мне позвонили",
        "мы были", "я встретил", "он сказал", "она сказала", "я говорю", "потом", "вдруг", "поехал", "приехал", "студи", "пришел"
    ]

    VAGUE = [
        "как бы", "что-то", "такое", "ну вот", "как сказать", "как бы", "в общем-то", "это это", "ээ", "э-э"
    ]


