class InterviewerDialogueActMarkers:

    BACKCHANNEL = [
        "ага", "угу", " ой", "о-о-о", " о."
    ]

    ACKNOWLEDGMENT = [
        "понятно", "ясно", "согласен", "понял", "хорошо"
    ]

    CLARIFICATION = [
        "что значит", "в смысле", "что это", "какие", "правильно понимаю",
        "уточните", "конкретнее", "почему именно", "то есть", "как я понимаю", "что за", "и что", "да?", "типа"
    ]

    OPEN_QUESTION = [
        "расскажите", "расскажи", "объясни", "объясните", "почему", "как", "что", "какой", "кто", "когда", "сколько", "скажи", "давно", "с каких пор", "бывали", "были", "на ваш взгляд", "на твой взгляд"
    ]

    CLOSED_END = (
        "да?", "правильно?", "не так ли?", "правильно понимаю?", "можно?", "было?", "мало?", "много?"
    )

    CLOSED_START = (
        "вы", "это", "они", "там", "было", "есть", "эта", "этот", "вы же", "чтобы"
    )

    TRANSITION_MARKERS = [
        "давайте поговорим", "мы поговорим", "для начала", "теперь", "вернемся", "следующий", "в курсе", "второй", "первый", "поговорим"
    ]

    CHALLENGE_MARKERS = [
        "но ведь", "разве", "вы уверены", "а почему не", "подождите", "ваша логика", "это же", "если все так делают"
    ]

    EMPATHY_MARKERS = [
        "понимаю", "неприятно", "тяжело", "непросто", "сложно"
    ]

    TOPIC_RETURN = [
        "вы не договорили про", "вернемся к", "но все-таки про"
    ]

    COMMENTARY_MARKERS = [
        "круто", "енеть", "супер", "какая история", "так это же круто"
    ]

    SUMMARY = [
        "то есть", "в общем", "получается",
        "я понял", "то, что", "вы говорите, что", "оказывается"
    ]


class InterviewerTechniqueMarkers:

    BEHAVIOUR = [
        "когда последний раз", "было ли", "бывали ли", "как это было",
        "в вашей жизни", "вы переживали", "вы говорили", "вы ездили", "вы были"
    ]

    WHY_QUESTION = [
        "почему", "зачем"
    ]

    HOW_QUESTION = [
        "как", "каким образом"
    ]

    VALUES = [
        "как вы относитесь", "что для вас значит", "разве не круто", "логик"
    ]

    FACT_CHECK = [
        "это правда", "действительно", "это было", "вы смотрели",
        "это фотошоп", "правда ли",
    ]

    DEFINITION = [
        "что значит", "что это такое", "что это", "что это за", "в смысле"
    ]

    REACTION = [
        "как вы отреагировали", "как ты отреагировал",
        "что почувствовали", "что почувствовал",
        "какая эмоция", "переживали",
    ]

    QUANTITY = [
        "сколько", "какая сумма", "что стоила",
        "что стоило", "цена", "стоимость"
    ]

    TIME = [
        "когда", "с каких пор",
        "до ", "после ",
        "в тот период", "последний раз"
    ]

    BACKGROUND = [
        "что это собой представляет", "как вы жили",
        "что это за",
        "где ты взял", "где вы взяли",
    ]

    RELATIONSHIP = [
        "кореша", "друзья", "знакомые"
        "вторая половина",
        "жена", "мама", "папа", "родные", "брат", "сестра"
    ]

    OPINION = [
        "как вы относитесь", "на ваш взгляд", "согласны с этим", "почему именно ее", "почему именно"
    ]

    EXAMPLE = [
        "расскажите", "приведите пример",
        "был случай", "самая крутая история", "история"
    ]

    HYPOTHETICAL_MARKERS = [
        "если бы", "представьте", "допустим", "а что если"
    ]

    CONFIRMATION = [
        "да?",
        "правильно понимаю",
        "я правильно понимаю",
        "то есть",
        "поэтому",
    ]

    FOLLOWUP = [
        "почему?", "какие?", "а она что?", "расскажите.", "расскажите", "что дальше?"
    ]


class GuestAnswerTypeMarkers:

    STORY_MARKERS = [
        "однажды", "помню", "было дело", "позавчера", "в прошлом", "назад", "мне позвонили",
        "мы были", "я встретил", "он сказал", "она сказала", "я говорю", "потом", "вдруг", "поехал", "приехал", "студи", "пришел"
    ]

    VAGUE = [
        "как бы", "что-то", "такое", "ну вот", "как сказать", "как бы", "в общем-то", "это это", "ээ", "э-э"
    ]


