class LinguisticProfileMarker:
    EMPATHY_MARKERS = [
        "понимаю",
        "я понимаю",
        "это непросто",
        "понятно",
        "сложно",
        "спасибо",
        "жестко",
        "жаль",
        "грустно"
        "ой",
        "ох",
        "ничего себе",
        "сочувствую"
        "ну да"
    ]

    HEDGING_MARKERS = [
        "как бы",
        "в общем",
        "мне кажется",
        "по-моему",
        "наверное",
        "вроде",
        "может быть",
        "скорее",
        "допустим",
        "скажем так",
        "так сказать",
        "если честно",
        "в принципе",
        "по большому счёту",
    ]

    PRESSURE_MARKERS = [
        "вы же",
        "ты же",
        "ну подождите",
        "подождите",
        "почему вы",
        "почему ты",
        "почему же",
        "разве",
        "это же",
        "неужели",
        "вы уверены",
        "ты уверен",
        "как вы это объясните",
        "как ты это объяснишь",
        "что значит",
        "серьёзно",
        "правильно понимаю",
        "я же правильно понимаю",
    ]

    FILLER_MARKERS = [
        "ну",
        "э",
        "э-э",
        "угу",
        "ага",
        "так",
        "вот",
        "то есть",
        "в общем",
        "слушай",
        "смотрите",
        "о",
        "о-о-о",
        "да ну",
        "ну да",
    ]

    FORMAL_MARKERS = [
        "расскажите",
        "объясните",
        "уточните",
        "как вы относитесь",
        "что значит",
        "с каких пор",
        "когда последний раз",
        "для начала",
        "мы поговорим",
        "поговорим про",
        "давайте об этом",
        "как вы переживали",
        "в вашей жизни",
        "как это было",
    ]

    PROVOCATION_MARKERS = [
        "вы же",
        "ты же",
        "это же",
        "ну же",
        "серьёзно",
        "история",
        "под фанеру",
        "не втирал бы",
    ]